In [ ]:
Answer_5

In [ ]:
#a)Top 10 ODI teams in menâ€™s cricket along with the records for matches, points and rating.

In [1]:
from bs4 import BeautifulSoup
import requests
import pandas as pd

In [2]:
info=requests.get('https://www.icc-cricket.com/rankings/mens/team-rankings/odi')

In [3]:
soup=BeautifulSoup(info.content)

In [4]:
team=soup.find_all('tr',class_=('rankings-block__banner','table-body'))

In [5]:
top10=team[0:10]

In [7]:
data = {'Team_Name':[],'Matches': [],'Points': [],'Rating':[]}

In [8]:
for i in top10:
    pnt=i.find_all('td',recursive=True)
    data['Team_Name'].append(i.find('span',class_='u-hide-phablet').text)
    data['Matches'].append(pnt[2].text)
    data['Points'].append(pnt[3].text)
    data['Rating'].append(pnt[4].text.replace('\n',''))
MenTeam=pd.DataFrame(data,index=range(1,11))
MenTeam

,Team_Name,Matches,Points,Rating
1,New Zealand,26,"3,045",117 ...
2,England,30,"3,400",113
3,Australia,32,"3,572",112
4,India,40,"4,377",109
5,Pakistan,25,"2,649",106
6,South Africa,24,"2,392",100
7,Bangladesh,33,"3,129",95
8,Sri Lanka,33,"2,917",88
9,Afghanistan,20,"1,419",71
10,West Indies,41,"2,902",71

In [ ]:
#b) Top 10 ODI Batsmen along with the records of their team and rating.

In [9]:
req=requests.get('https://www.icc-cricket.com/rankings/mens/player-rankings/odi/batting')

In [10]:
soup=BeautifulSoup(req.content)

In [11]:
player=soup.find_all('tr',class_=('rankings-block__banner','table-body'))

In [17]:
Top10=player[0:10]

In [18]:
data={'Player_Name':[],'Team_Name': [], 'Rating':[]}

In [19]:
for i in Top10:
    bat=i.find_all('td',recursive=True)
    data['Player_Name'].append(bat[1].text.replace('\n',''))
    data['Team_Name'].append(bat[2].text.replace('\n',''))
    data['Rating'].append(bat[3].text.replace('\n',''))
ODIBATSMAN=pd.DataFrame(data,index=range(1,11))
ODIBATSMAN

              Player_Name                Team_Name Rating
1              Babar Azam  PAK                        891
2   Rassie van der Dussen                       SA    766
3             Imam-ul-Haq                      PAK    764
4         Quinton de Kock                       SA    759
5            David Warner                      AUS    747
6             Virat Kohli                      IND    726
7             Steve Smith                      AUS    719
8            Rohit Sharma                      IND    715
9          Jonny Bairstow                      ENG    710
10           Fakhar Zaman                      PAK    695

In [ ]:
#c) Top 10 ODI bowlers along with the records of their team and rating.

In [20]:
req=requests.get('https://www.icc-cricket.com/rankings/mens/player-rankings/odi/bowling')

In [21]:
soup=BeautifulSoup(req.content)

In [22]:
bowler=soup.find_all('tr',class_=('rankings-block__banner','table-body'))

In [23]:
Top10=bowler[0:10]

In [24]:
bdata={'Player_Name':[],'Team_Name': [], 'Rating':[]}

In [25]:
for i in Top10:
    bat=i.find_all('td',recursive=True)
    bdata['Player_Name'].append(bat[1].text.replace('\n',''))
    bdata['Team_Name'].append(bat[2].text.replace('\n',''))
    bdata['Rating'].append(bat[3].text.replace('\n',''))
ODIBOWL=pd.DataFrame(bdata,index=range(1,11))

In [39]:
ODIBOWL

          Player_Name               Team_Name Rating
1         Trent Boult  NZ                        744
2      Josh Hazlewood                     AUS    727
3      Mitchell Starc                     AUS    665
4         Rashid Khan                     AFG    659
5          Matt Henry                      NZ    656
6          Adam Zampa                     AUS    655
7      Shaheen Afridi                     PAK    654
8     Shakib Al Hasan                     BAN    652
9   Mustafizur Rahman                     BAN    638
10   Mujeeb Ur Rahman                     AFG    637

In [ ]:
Answer_6

In [ ]:
#a) Top 10 ODI teams in womenâ€™s cricket along with the records for matches, points and rating

In [31]:
from bs4 import BeautifulSoup
import requests
import pandas as pd

In [32]:
req=requests.get('https://www.icc-cricket.com/rankings/womens/team-rankings/odi')

In [33]:
soup=BeautifulSoup(req.content)

In [34]:
team=soup.find_all('tr',class_=('rankings-block__banner','table-body'))

In [35]:
top10=team[0:10]

In [36]:
data = {'Team_Name':[],'Matches': [],'Points': [],'Rating':[]}

In [37]:
for i in top10:
    pnt=i.find_all('td',recursive=True)
    data['Team_Name'].append(i.find('span',class_='u-hide-phablet').text)
    data['Matches'].append(pnt[2].text)
    data['Points'].append(pnt[3].text)
    data['Rating'].append(pnt[4].text.strip().replace('\n',''))
WomenTeam=pd.DataFrame(data,index=range(1,11))

In [38]:
WomenTeam

       Team_Name Matches Points Rating
1      Australia      18  3,061    170
2        England      28  3,342    119
3   South Africa      26  3,098    119
4          India      27  2,820    104
5    New Zealand      25  2,553    102
6    West Indies      27  2,535     94
7     Bangladesh      13    983     76
8       Thailand       8    572     72
9       Pakistan      24  1,519     63
10     Sri Lanka       8    353     44

In [ ]:
#b) Top 10 womenâ€™s ODI Batting players along with the records of their team and rating.

In [41]:
req=requests.get('https://www.icc-cricket.com/rankings/womens/player-rankings/odi/batting')

In [42]:
soup=BeautifulSoup(req.content)

In [43]:
player=soup.find_all('tr',class_=('rankings-block__banner','table-body'))

In [44]:
top10=player[0:10]
data={'Player_Name':[],'Team_Name': [], 'Rating':[]}

In [45]:
for i in top10:
    bat=i.find_all('td',recursive=True)
    data['Player_Name'].append(bat[1].text.replace('\n',''))
    data['Team_Name'].append(bat[2].text.replace('\n',''))
    data['Rating'].append(bat[3].text.replace('\n',''))
BATW=pd.DataFrame(data,index=range(1,11))  
BATW

            Player_Name                Team_Name Rating
1          Alyssa Healy  AUS                        785
2           Beth Mooney                      AUS    749
3       Laura Wolvaardt                       SA    732
4        Natalie Sciver                      ENG    731
5      Harmanpreet Kaur                      IND    716
6       Smriti Mandhana                      IND    714
7           Meg Lanning                      AUS    710
8        Rachael Haynes                      AUS    701
9   Chamari Athapaththu                       SL    655
10         Ellyse Perry                      AUS    642

In [ ]:
#c) Top 10 womenâ€™s ODI all-rounder along with the records of their team and rating

In [46]:
req=requests.get('https://www.icc-cricket.com/rankings/womens/player-rankings/odi/all-rounder')

In [47]:
soup=BeautifulSoup(req.content)

In [48]:
allrounder=soup.find_all('tr',class_=('rankings-block__banner','table-body'))

In [49]:
top10=player[0:10]
data={'Allrounder_Name':[],'Team_Name': [], 'Rating':[]}

In [50]:
for i in top10:
    bat=i.find_all('td',recursive=True)
    data['Allrounder_Name'].append(bat[1].text.replace('\n',''))
    data['Team_Name'].append(bat[2].text.replace('\n',''))
    data['Rating'].append(bat[3].text.replace('\n',''))
Women_All=pd.DataFrame(data,index=range(1,11))

In [51]:
Women_All

        Allrounder_Name                Team_Name Rating
1          Alyssa Healy  AUS                        785
2           Beth Mooney                      AUS    749
3       Laura Wolvaardt                       SA    732
4        Natalie Sciver                      ENG    731
5      Harmanpreet Kaur                      IND    716
6       Smriti Mandhana                      IND    714
7           Meg Lanning                      AUS    710
8        Rachael Haynes                      AUS    701
9   Chamari Athapaththu                       SL    655
10         Ellyse Perry                      AUS    642